  DSN SYSTEM(DDBC)                                                              
      RUN PROGRAM(GCCPSCD2) -                                                   
      PLAN(YCBTCHD1)                                                            
  END                                                                           
