      **************************************************************            
      *  GARDATEC ( FORMERLY GUSDATEC PARAMERTERS)                              
      **************************************************************            
      *01  VAPS-FIGURATIVE-CONSTANTS.                                           
         03  VAPS-FIGURATIVE-CONSTANTS.                                         
           05  HIGH-DATE           COMP-3.                                      
               10  HIGH-YEAR       VALUE +999      PIC S9(3).                   
               10  HIGH-DAY        VALUE +365      PIC S9(3).                   
           05  LOW-DATE            COMP-3.                                      
               10  LOW-YEAR        VALUE +000      PIC S9(3).                   
               10  LOW-DAY         VALUE +001      PIC S9(3).                   
      *                                                                         
           05  BINARY-CONSTANTS    COMP.                                        
               10  BIN-1           VALUE +1        PIC S9(4).                   
               10  BIN-2           VALUE +2        PIC S9(4).                   
               10  BIN-3           VALUE +3        PIC S9(4).                   
               10  BIN-4           VALUE +4        PIC S9(4).                   
               10  BIN-5           VALUE +5        PIC S9(4).                   
               10  BIN-6           VALUE +6        PIC S9(4).                   
               10  BIN-7           VALUE +7        PIC S9(4).                   
               10  BIN-8           VALUE +8        PIC S9(4).                   
               10  BIN-9           VALUE +9        PIC S9(4).                   
      *                                                                         
           05  PACKED-CONSTANTS    COMP-3.                                      
               10  PACK-1          VALUE +1        PIC S9.                      
               10  PACK-2          VALUE +2        PIC S9.                      
               10  PACK-3          VALUE +3        PIC S9.                      
               10  PACK-4          VALUE +4        PIC S9.                      
               10  PACK-5          VALUE +5        PIC S9.                      
               10  PACK-6          VALUE +6        PIC S9.                      
               10  PACK-7          VALUE +7        PIC S9.                      
               10  PACK-8          VALUE +8        PIC S9.                      
               10  PACK-9          VALUE +9        PIC S9.                      
           EJECT                                                                
           05  CHARACTER-CONSTANTS.                                             
               10  CHAR-1          VALUE '1'       PIC X.                       
               10  CHAR-2          VALUE '2'       PIC X.                       
               10  CHAR-3          VALUE '3'       PIC X.                       
               10  CHAR-4          VALUE '4'       PIC X.                       
               10  CHAR-5          VALUE '5'       PIC X.                       
               10  CHAR-6          VALUE '6'       PIC X.                       
               10  CHAR-7          VALUE '7'       PIC X.                       
               10  CHAR-8          VALUE '8'       PIC X.                       
               10  CHAR-9          VALUE '9'       PIC X.                       
      *                                                                         
               10  CHAR-A          VALUE 'A'       PIC X.                       
               10  CHAR-B          VALUE 'B'       PIC X.                       
               10  CHAR-C          VALUE 'C'       PIC X.                       
               10  CHAR-D          VALUE 'D'       PIC X.                       
               10  CHAR-E          VALUE 'E'       PIC X.                       
               10  CHAR-F          VALUE 'F'       PIC X.                       
               10  CHAR-G          VALUE 'G'       PIC X.                       
               10  CHAR-H          VALUE 'H'       PIC X.                       
               10  CHAR-I          VALUE 'I'       PIC X.                       
               10  CHAR-J          VALUE 'J'       PIC X.                       
               10  CHAR-K          VALUE 'K'       PIC X.                       
               10  CHAR-L          VALUE 'L'       PIC X.                       
               10  CHAR-M          VALUE 'M'       PIC X.                       
               10  CHAR-N          VALUE 'N'       PIC X.                       
               10  CHAR-O          VALUE 'O'       PIC X.                       
               10  CHAR-P          VALUE 'P'       PIC X.                       
               10  CHAR-Q          VALUE 'Q'       PIC X.                       
               10  CHAR-R          VALUE 'R'       PIC X.                       
               10  CHAR-S          VALUE 'S'       PIC X.                       
               10  CHAR-T          VALUE 'T'       PIC X.                       
               10  CHAR-U          VALUE 'U'       PIC X.                       
               10  CHAR-V          VALUE 'V'       PIC X.                       
               10  CHAR-W          VALUE 'W'       PIC X.                       
               10  CHAR-X          VALUE 'X'       PIC X.                       
               10  CHAR-Y          VALUE 'Y'       PIC X.                       
               10  CHAR-Z          VALUE 'Z'       PIC X.                       
