      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TADVSR                             *        
      ******************************************************************        
       01  DCLTADVSR.                                                           
           10 CUST-ID              PIC S9(11)V USAGE COMP-3.                    
           10 ADVISOR-ID           PIC X(06).                                   
           10 CHN-TS               PIC X(26).                                   
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 03      *        
      ******************************************************************        
