      ******************************************************************        
      * COBOL DECLARATION FOR TABLE DBCYCD3.TADVME                     *        
      ******************************************************************        
       01  DCLTADVME.                                                           
           10 MGR-USER-ID          PIC X(20).                                   
           10 EMP-USER-ID          PIC X(20).                                   
           10 CHN-USER-ID          PIC X(20).                                   
           10 REQ-TS               PIC X(26).                                   
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 4       *        
      ******************************************************************        
