      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TAUDEV                             *        
      ******************************************************************        
       01  DCLTAUDEV.                                                           
           10 CUST-ID              PIC S9(11) USAGE COMP-3.                     
           10 AUD-TYP-CD           PIC X(6).                                    
           10 CHN-USER-ID          PIC X(20).                                   
           10 CHN-TS               PIC X(26).                                   
           10 SIGNON-USER-ID       PIC X(20).                                   
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 5       *        
      ******************************************************************        
