      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TCL                                *        
      ******************************************************************        
       01  DCLTCL.                                                              
           10 CLIENT-NUM           PIC X(7).                                    
           10 LOC-NUM              PIC X(3).                                    
           10 LOC-STAT-CD          PIC X(1).                                    
           10 CHN-USER-ID          PIC X(20).                                   
           10 CHN-TS               PIC X(26).                                   
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 5       *        
      ******************************************************************        
