      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TCPMU                              *        
      ******************************************************************        
       01  DCLTCPMU.                                                            
           10 CPM-USER-ID          PIC X(10).                                   
           10 CPM-ACC-TYP-CD       PIC X(6).                                    
           10 CPM-USER-STAT-CD     PIC X(1).                                    
           10 CHN-USER-ID          PIC X(20).                                   
           10 CHN-TS               PIC X(26).                                   
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 5       *        
      ******************************************************************        
