      ***************************************************************** 00010000
      * COBOL DECLARATION FOR TABLE TCPMUS                            * 00020000
      ***************************************************************** 00030000
       01  DCLTCPMUS.                                                   00040001
           10  CPM-USER-ID               PIC X(10).                     00050000
           10  CPM-FIRST-NAME            PIC X(30).                     00060000
           10  CPM-LAST-NAME             PIC X(30).                     00070000
           10  DEPT                      PIC X(4).                      00080000
           10  CHN-USER-ID               PIC X(20).                     00090002
           10  CHN-TS                    PIC X(26).                     00100000
      ***************************************************************** 00110000
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 6      * 00120000
      ***************************************************************** 00130000
