      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TCTBS                              *        
      ******************************************************************        
       01  DCLTCTBS.                                                            
           10 CODE-VALUE           PIC X(1).                                    
           10 CODE-ENG-DESC        PIC X(50).                                   
           10 CODE-FR-DESC         PIC X(50).                                   
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 3       *        
      ******************************************************************        
