      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TCTCAT                             *        
      ******************************************************************        
       01  DCLTCTCAT.                                                           
           10 CODE-VALUE           PIC X(6).                                    
           10 CODE-ENG-DESC        PIC X(50).                                   
           10 CODE-FR-DESC         PIC X(50).                                   
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 3       *        
      ******************************************************************        
