      ***************************************************************** 00010000
      * COBOL DECLARATION FOR TABLE TCTTAT                            * 00020000
      ***************************************************************** 00030000
       01  DCLTCTTAT.                                                   00040000
           10  CODE-VALUE                PIC X(2).                      00050000
           10  CODE-ENG-DESC             PIC X(50).                     00060000
           10  CODE-FR-DESC              PIC X(50).                     00070000
      ***************************************************************** 00110000
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 3      * 00120000
      ***************************************************************** 00130000
