      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TEH                                *        
      ******************************************************************        
       01  DCLTEH.                                                              
           10 CUST-ID              PIC S9(11)V USAGE COMP-3.                    
           10 EVENT-TYP-CD         PIC X(6).                                    
           10 EVENT-TS             PIC X(26).                                   
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 3       *        
      ******************************************************************        
