      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TGCT                               *        
      ******************************************************************        
       01  DCLTGCT.                                                             
           10 GROUP-ID             PIC X(7).                                    
           10 CERT-ID              PIC X(10).                                   
           10 CUST-ID              PIC S9(11)V USAGE COMP-3.                    
           10 CHN-USER-ID          PIC X(20).                                   
           10 CHN-TS               PIC X(26).                                   
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 5       *        
      ******************************************************************        
