      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TGDADV                             *        
      ******************************************************************        
       01  DCLTGDADV.                                                           
           10 GROUP-ID             PIC X(7).                                    
           10 DIV-ID               PIC X(3).                                    
           10 ADVISOR-ID           PIC X(6).                                    
           10 CHN-TS               PIC X(26).                                   
           10 ACC-IND              PIC X(1).                                    
           10 ADVISOR-AGENCY-ID    PIC X(6).                                    
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 6       *        
      ******************************************************************        
