      ***************************************************************** 00010000
      * COBOL DECLARATION FOR TABLE TGDFA                             * 00020000
      ***************************************************************** 00030000
       01  DCLTGDFA.                                                    00040000
           10  GROUP-ID                  PIC X(7).                      00050000
           10  DIV-ID                    PIC X(3).                      00060000
           10  SITE                      PIC X(4).                      00070000
           10  FUNCTION-NAME             PIC X(8).                      00080000
           10  ACC-IND                   PIC X(1).                      00081000
           10  CHN-USER-ID               PIC X(20).                     00090000
           10  CHN-TS                    PIC X(26).                     00100000
           10  SUBMIT-TYP-CD             PIC X(1).                      00101001
      ***************************************************************** 00110000
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 8      * 00120000
      ***************************************************************** 00130000
