      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TLH                                *        
      ******************************************************************        
       01  DCLTLH.                                                              
           10 CUST-ID              PIC S9(11)V USAGE COMP-3.                    
           10 LOGIN-TS             PIC X(26).                                   
           10 LOGIN-SUCC-IND       PIC X(1).                                    
           10 LOGIN-TYP-CD         PIC X(1).                                    
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 3       *        
      ******************************************************************        
