      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TMXKEY                             *        
      ******************************************************************        
       01  DCLTMXKEY.                                                           
           10 KEY-TYP              PIC X(10).                                   
           10 MAX-KEY-VALUE        PIC S9(11)V USAGE COMP-3.                    
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 2       *        
      ******************************************************************        
