      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TPAA                               *        
      ******************************************************************        
       01  DCLTPAA.                                                             
           10 CUST-ID              PIC S9(11)V USAGE COMP-3.                    
           10 GROUP-ID             PIC X(7).                                    
           10 DIV-ID               PIC X(3).                                    
           10 PA-STAT-CD           PIC X(1).                                    
           10 CHN-USER-ID          PIC X(20).                                   
           10 CHN-TS               PIC X(26).                                   
           10 BILL-PRSNT-IND       PIC X(1).                                    
           10 PAY-HIST-IND         PIC X(1).                                    
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 6       *        
      ******************************************************************        
