      ******************************************************************        
      * COBOL NULL INDICATOR DECLARATION FOR TABLE TSD   *                      
      ******************************************************************        
           10 SENT-TO-PRINT-TS-I   PIC S9(4) COMP.                              
           10 PURGE-TS-I           PIC S9(4) COMP.                              
