      ******************************************************************        
      * COBOL DECLARATION FOR TABLE TUT                                *        
      ******************************************************************        
       01  DCLTUT.                                                              
           10 USER-ID              PIC X(20).                                   
           10 CUST-ID              PIC S9(11)V USAGE COMP-3.                    
           10 CHN-USER-ID          PIC X(20).                                   
           10 CHN-TS               PIC X(26).                                   
           10 MAPPED-REG-ID        PIC X(20).                                   
           10 MAPPED-ID            PIC X(20).                                   
      ******************************************************************        
      * THE NUMBER OF COLUMNS DESCRIBED BY THIS DECLARATION IS 6       *        
      ******************************************************************        
