//GLCHRPRP PROC CBACCNT=PGL,                                                    
//             CTLLOC=PEN.GROUP.PROD.STANDARD.CTLCARDS,                         
//             NODE2=CHRYSLER,                                                  
//             NODE3=PROD,                                                      
//*            OUTMAIL='(B,SMTP)',                                              
//             RPTID='(5,PGLPR043)',                                            
//             UNIT='PROD'                                                      
//*******************************************************************           
//* SORT THE INPUT FILE TO ONLY PROCESS RECORDS WITH TYPE 2                     
//*******************************************************************           
//*                                                                             
//STEP010 EXEC PGM=SORT                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSUDUMP  DD SYSOUT=*                                                         
//SYSSNAP   DD SYSOUT=*                                                         
//SYSIN     DD DSN=&CTLLOC.(GLCHRSRT),                                          
//             DISP=SHR                                                         
//SORTIN    DD DSN=&CBACCNT..&NODE2..&NODE3..CONTROL(CHRYSNOW),                 
//             DISP=SHR                                                         
//SORTOUT   DD DSN=&CBACCNT..&NODE2..&NODE3..PREMSORT,                          
//             DISP=(NEW,CATLG,DELETE),                                         
//             UNIT=&UNIT,                                                      
//             SPACE=(TRK,(10,2),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=80)                                          
//SORTWK01  DD UNIT=WORK,                                                       
//             SPACE=(TRK,(25,5),RLSE)                                          
//SORTWK02  DD UNIT=WORK,                                                       
//             SPACE=(TRK,(25,5),RLSE)                                          
//SORTWK03  DD UNIT=WORK,                                                       
//             SPACE=(TRK,(25,5),RLSE)                                          
//*******************************************************************           
//* PRODUCE THE PREM REPORT                                                     
//*******************************************************************           
//*                                                                             
//STEP020 EXEC PGM=GLCHRPRE                                                     
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//FILEA     DD DSN=&CBACCNT..&NODE2..&NODE3..PREMSORT,                          
//             DISP=SHR                                                         
//REPTFILE  DD DSN=&CBACCNT..&NODE2..&NODE3..PREMRPT(+1),                       
//             DISP=(NEW,CATLG,DELETE),                                         
//             UNIT=&UNIT,                                                      
//             SPACE=(TRK,(10,2),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=166)                                         
//FILEC     DD SYSOUT=&RPTID                                                    
//**********************************************************************        
//* SEND AN E-MAIL TO NOTIFY COMPLETION.                                        
//**********************************************************************        
//                                                                              
//STEP030 EXEC PGM=SMTPMAIL,                                                    
//             COND=(0,NE)                                                      
//SMTPOUT   DD SYSOUT=&OUTMAIL                                                  
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSUDUMP  DD SYSOUT=*                                                         
//SMTPIN    DD DSN=&CTLLOC.(GLCHRMAI),                                          
//             DISP=SHR                                                         
//          DD DSN=&CBACCNT..&NODE2..&NODE3..PREMAIL,                           
//             DISP=SHR                                                         
//*********************************************************                     
//*   DELETE SORTED FILE AFTER SUCESSFUL RUN              *                     
//*********************************************************                     
//*                                                                             
//STEP04  EXEC PGM=IEFBR14,                                                     
//             COND=(0,NE)                                                      
//DD1       DD DSN=&CBACCNT..&NODE2..&NODE3..PREMSORT,                          
//             DISP=(MOD,DELETE,DELETE),                                        
//             UNIT=&UNIT,                                                      
//             SPACE=(TRK,(0))                                                  
