      *-----------------------------------------------------------------        
      * THIS IS THE FORMAT OF THE ADDITIONAL INFORMATION THAT WILL BE           
      * PASSED INTO THE TRAILER PROGRAM TO PUT ON THE TRAILER RECORD.           
      *-----------------------------------------------------------------        
      *---------------------------------------------------------------*         
       05 CMR-INFO.                                                             
         10  CMR-INFO-JOBNAME                PIC X(10).                         
         10  FILLER                          PIC X(1).                          
         10  CMR-INFO-FILENAME               PIC X(15).                         
         10  FILLER                          PIC X(54).                         
