      *****************************************************************         
      *     CUSTOMER PROFILE DATABASE (CPD) CONFIRMATION LETTER       *         
      *     CLIENT LISTING FOR VO ITEMS                               *         
      *     THIS LISTING IS SUBSEQUNTLY USED TO RESET CPD ADDRESSES   *         
      *                                                               *         
      *                                                               *         
      *****************************************************************         
      *****************************************************************         
      *    AUG/11/03 KLYN          - CREATION                         *         
      *                                                               *         
      *****************************************************************         
      *                                                                         
      *01  GCCCPVOC.                                                            
                                                                                
           05  GCCCPVOC-CUST-ID              PIC S9(11)V                        
                                                   USAGE COMP-3.                
           05  GCCCPVOC-GROUP-ID             PIC 9(7).                          
           05  GCCCPVOC-CERT-ID              PIC X(10).                         
           05  FILLER                        PIC X(4).                          
