           SKIP1                                                                
      ******************************************************************        
      *                                                                *        
      *                        G L B A N R                             *        
      *                                                                *        
      *   1. BANNER PAGE LAYOUT                                        *        
      *                                                                *        
      *                                                                *        
      ******************************************************************        
           SKIP1                                                                
      ******************************************************************        
      *                                                                *        
      *  CHANGE LOG            G L B A N R                             *        
      *  **********                                                    *        
      *                                                                *        
      *  NO   DATE     PGR   DESCRIPTION                               *        
      *  --   ------   ---   ----------------------------------------  *        
      *                                                                *        
      *  00 - 001108 - JAK   NEW COPYBOOK                              *        
      *  01 - 210601 - JE    CHANGED TO INCREASE LINE SIZE TO 70 AND   *        
      *                      INCREASE THE NUMBER OF LINES TO 15        *        
      *                                                                *        
      ******************************************************************        
      *** CHGLOG START - 00 - YYMMDD - AAA *****************************        
      *** CHGLOG END   - 00 - YYMMDD - AAA *****************************        
      *01  GLBANR-RECORD.                                                       
           05  GLBANR-CC                           PIC X.                       
           05  GLBANR-FORM-TYPE                    PIC XX.                      
      *                                                                         
           05  GLBANR-DETAIL.                                                   
               10  GLBANR-LINE1                    PIC X(70).                   
               10  GLBANR-LINE2                    PIC X(70).                   
               10  GLBANR-LINE3                    PIC X(70).                   
               10  GLBANR-LINE4                    PIC X(70).                   
               10  GLBANR-LINE5                    PIC X(70).                   
               10  GLBANR-LINE6                    PIC X(70).                   
               10  GLBANR-LINE7                    PIC X(70).                   
               10  GLBANR-LINE8                    PIC X(70).                   
               10  GLBANR-LINE9                    PIC X(70).                   
               10  GLBANR-LINE10                   PIC X(70).                   
               10  GLBANR-LINE11                   PIC X(70).                   
               10  GLBANR-LINE12                   PIC X(70).                   
               10  GLBANR-LINE13                   PIC X(70).                   
               10  GLBANR-LINE14                   PIC X(70).                   
               10  GLBANR-LINE15                   PIC X(70).                   
