      ****************************************************************          
      *                                                              *          
      *  CONTENT SERVICE OUTPUT PROTOCOL FOR MEMPHONE                *          
      *                                                              *          
      *--------------------------------------------------------------*          
      *  CHANGE LOG:                                                 *          
      *                                                              *          
      *  AUTHOR       DATE     DESCRIPTION                           *          
      ****************************************************************          
      *  R. CREWSON JUN 5, 2002 ITIAL CREATION - IEL PROJECT         *          
      ****************************************************************          
      *01 MLCTOCLU-MEMPHONE-OUTPUT.                                             
          05 MLCTOCLU-MEMPHONE-VALID  PIC X(01).                                
          05 MLCTOCLU-MEMPHONE-PH-NUM PIC X(14).                                
