      ****************************************************************          
      *                                                              *          
      *  CONTENT SERVICE INPUT PROTOCOL FOR PRIORITY CLIENT          *          
      *                                                              *          
      *--------------------------------------------------------------*          
      *  CHANGE LOG:                                                 *          
      *                                                              *          
      *  AUTHOR       DATE     DESCRIPTION                           *          
      ****************************************************************          
      *  R. CREWSON JUN 5, 2002 ITIAL CREATION - IEL PROJECT         *          
      ****************************************************************          
      *01 MLCTOCLU-PRTYCLNT-INPUT                                               
          05 MLCTOCLU-PRTYCLNT-PLAN-NUMBER PIC X(07).                           
          05 MLCTOCLU-PRTYCLNT-DIVISION    PIC X(03).                           
