      ****************************************************************          
      *                                                              *          
      *  CONTENT SERVICE INPUT PROTOCOL FOR FLASHFRM                 *          
      *   - VARIABLE DATA TO BE INCLUDED ON FLASHED CLAIM FORMS      *          
      *                                                              *          
      *--------------------------------------------------------------*          
      *  CHANGE LOG:                                                 *          
      *                                                              *          
      *  AUTHOR       DATE     DESCRIPTION                           *          
      ****************************************************************          
      *  F. MUELLER  SEPT 2002 INITIAL CREATION - IEL PROJECT        *          
      ****************************************************************          
      *01 MLCTOCLU-FLASHFRM-INPUT                                               
          05 MLCTOCLU-FLASHFRM-PLAN-NUMBER PIC X(07).                           
          05 MLCTOCLU-FLASHFRM-DIVISION    PIC X(03).                           
          05 MLCTOCLU-FLASHFRM-LOCATION    PIC X(03).                           
