      ****************************************************************          
      *                                                              *          
      * CONTENT SERVICE INPUT PROTOCOL FOR MEMPHONE                  *          
      *                                                              *          
      *--------------------------------------------------------------*          
      *  CHANGE LOG:                                                 *          
      *                                                              *          
      *  AUTHOR       DATE     DESCRIPTION                           *          
      ****************************************************************          
      *  R. CREWSON JUN 5, 2002 ITIAL CREATION - IEL PROJECT         *          
      ****************************************************************          
      *01 MLCTOCLU-MEMPHONE-INPUT                                               
          05 MLCTOCLU-MEMPHONE-PLAN-NUMBER PIC X(07).                           
          05 MLCTOCLU-MEMPHONE-DESTINATION PIC X(01).                           
