      ****************************************************************          
      *                                                              *          
      * CONTENT SERVICE INPUT PROTOCOL FOR PDTODATE                  *          
      *                                    PAID TO DATE AMOUNTS      *          
      *--------------------------------------------------------------*          
      *  CHANGE LOG:                                                 *          
      *                                                              *          
      *  AUTHOR       DATE     DESCRIPTION                           *          
      ****************************************************************          
      *  N JEFFREY  JAN, 2003  CREATION        - IEL PROJECT         *          
      ****************************************************************          
      *01 MLCTOCLU-PDTODATE-INPUT.                                              
          05 MLCTOCLU-PDTODATE-PLAN-NUMBER  PIC X(07).                          
          05 MLCTOCLU-PDTODATE-DIVISION     PIC X(03).                          
