      ****************************************************************          
      *                                                              *          
      *  CONTENT SERVICE INPUT PROTOCOL FOR CHEQLOGO                 *          
      *                                                              *          
      *--------------------------------------------------------------*          
      *  CHANGE LOG:                                                 *          
      *                                                              *          
      *  AUTHOR       DATE     DESCRIPTION                           *          
      ****************************************************************          
      *  R. CREWSON JUN 5, 2002 ITIAL CREATION - IEL PROJECT         *          
      ****************************************************************          
      *01 MLCTOCLU-CHEQLOGO-INPUT                                               
          05 MLCTOCLU-CHEQLOGO-PLAN-NUMBER PIC X(07).                           
          05 MLCTOCLU-CHEQLOGO-DIVISION    PIC X(03).                           
          05 MLCTOCLU-CHEQLOGO-LOCATION    PIC X(03).                           
