//PGB1110  JOB (GP-GB91),GB,CLASS=P,REGION=0M,                                  
//             MSGCLASS=A                                                       
/*JOBPARM R=M04A,L=200                                                          
//*LOGONID PYCUTIL                                                              
//*********************************************************************         
//*                                                                   *         
//*  CUSTOMER PROFILE/REGISTRATION SYSTEM                             *         
//*    INTERNET REPORT OF CONFIRMATION NUMBER, FORM,                  *         
//*    GROUP, ACCOUNT, CERT NUMBER, TIMESTAMP,                        *         
//*    LANGUAGE, CERT NAME.                                           *         
//*                                                                   *         
//*********************************************************************         
//TGBPROCS   JCLLIB ORDER=(PEN.GROUP.PROD.STANDARD.PROCLIB)                     
//*                                                                             
//PSTEP1  EXEC GB1110                                                           
